In [1]:
import pandas as pd

In [2]:
transaction = pd.read_csv('csv/transaction.csv', delimiter=';')
transaction.head()

,transaction_id,item_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,NaN,2,2950,25.02.2017,False,Approved,Solex,Standard,medium,medium,"71,49","53,62"
1,2,NaN,3,3120,21.05.2017,True,Approved,Trek Bicycles,Standard,medium,large,"2091,47","388,92"
2,3,NaN,37,402,16.10.2017,False,Approved,OHM Cycles,Standard,low,medium,"1793,43","248,82"
3,4,NaN,88,3135,31.08.2017,False,Approved,Norco Bicycles,Standard,medium,medium,"1198,46","381,10"
4,5,NaN,78,787,01.10.2017,True,Approved,Giant Bicycles,Standard,medium,large,"1765,3","709,48"

In [3]:
item = pd.read_csv('csv/item.csv', delimiter=';')
item.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 204 entries, 0 to 203
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   item_id        204 non-null    int64
 1   product_id     204 non-null    int64
 2   brand          203 non-null    object
 3   product_line   203 non-null    object
 4   product_class  203 non-null    object
 5   product_size   203 non-null    object
 6   standard_cost  203 non-null    object
dtypes: int64(2), object(5)
memory usage: 11.3+ KB

In [4]:
# Excel не дочистил дубликаты в item. Дочищаем.
item_columns = ['product_id', 'brand', 'product_line', 'product_class', 'product_size', 'standard_cost']
item.drop_duplicates(item_columns, inplace=True)
item.info()

<class 'pandas.core.frame.DataFrame'>
Index: 202 entries, 0 to 203
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   item_id        202 non-null    int64
 1   product_id     202 non-null    int64
 2   brand          201 non-null    object
 3   product_line   201 non-null    object
 4   product_class  201 non-null    object
 5   product_size   201 non-null    object
 6   standard_cost  201 non-null    object
dtypes: int64(2), object(5)
memory usage: 12.6+ KB

In [5]:
# проставляем в таблицу transacrion соответствующие item_id из таблицы item
upd_trans = transaction.drop(columns='item_id')
upd_trans = upd_trans.merge(item, how='left', on=item_columns)
upd_trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    20000 non-null  int64
 1   product_id        20000 non-null  int64
 2   customer_id       20000 non-null  int64
 3   transaction_date  20000 non-null  object
 4   online_order      19640 non-null  object
 5   order_status      20000 non-null  object
 6   brand             19803 non-null  object
 7   product_line      19803 non-null  object
 8   product_class     19803 non-null  object
 9   product_size      19803 non-null  object
 10  list_price        20000 non-null  object
 11  standard_cost     19803 non-null  object
 12  item_id           20000 non-null  int64
dtypes: int64(4), object(9)
memory usage: 2.0+ MB

In [6]:
# убираем уже не нужные столбцы, которые перенесли в таблицу item
upd_trans = upd_trans.drop(columns=item_columns)
# возвращаем столбец item_id на вторую позицию
upd_trans = upd_trans[['transaction_id', 'item_id', 'customer_id','transaction_date','online_order','order_status','list_price']] 
upd_trans.head()

,transaction_id,item_id,customer_id,transaction_date,online_order,order_status,list_price
0,1,30,2950,25.02.2017,False,Approved,"71,49"
1,2,32,3120,21.05.2017,True,Approved,"2091,47"
2,3,94,402,16.10.2017,False,Approved,"1793,43"
3,4,179,3135,31.08.2017,False,Approved,"1198,46"
4,5,161,787,01.10.2017,True,Approved,"1765,3"

In [7]:
# сохраняем обновленную таблицу транзакций в новый файл
upd_trans.to_csv('csv/upd_transaction.csv', index=False)